#### 📖 Terraform Plan ('infra-pe/resources/uat') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dns.azurerm_private_dns_zone.private_dns_zones["azure_api_net"] will be destroyed
  # (because azurerm_private_dns_zone.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "private_dns_zones" {
      - id                                                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/azure-api.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "azure-api.net" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                                                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "azure-api.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["azurewebsites"] will be destroyed
  # (because azurerm_private_dns_zone.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "private_dns_zones" {
      - id                                                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.azurewebsites.net" -> null
      - number_of_record_sets                                 = 3 -> null
      - resource_group_name                                   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                                                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.azurewebsites.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["blob"] will be destroyed
  # (because azurerm_private_dns_zone.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "private_dns_zones" {
      - id                                                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.blob.core.windows.net" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                                                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.blob.core.windows.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["documents"] will be destroyed
  # (because azurerm_private_dns_zone.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "private_dns_zones" {
      - id                                                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.documents.azure.com" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                                                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.documents.azure.com." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["file"] will be destroyed
  # (because azurerm_private_dns_zone.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "private_dns_zones" {
      - id                                                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.file.core.windows.net" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                                                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.file.core.windows.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["management_azure_api_net"] will be destroyed
  # (because azurerm_private_dns_zone.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "private_dns_zones" {
      - id                                                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/management.azure-api.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "management.azure-api.net" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                                                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "management.azure-api.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["psql"] will be destroyed
  # (because azurerm_private_dns_zone.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "private_dns_zones" {
      - id                                                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.postgres.database.azure.com" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                                                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.postgres.database.azure.com." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["queue"] will be destroyed
  # (because azurerm_private_dns_zone.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "private_dns_zones" {
      - id                                                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.queue.core.windows.net" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                                                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.queue.core.windows.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["redis"] will be destroyed
  # (because azurerm_private_dns_zone.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "private_dns_zones" {
      - id                                                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.redis.cache.windows.net" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                                                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.redis.cache.windows.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["scm_azure_api_net"] will be destroyed
  # (because azurerm_private_dns_zone.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "private_dns_zones" {
      - id                                                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/scm.azure-api.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "scm.azure-api.net" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                                                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "scm.azure-api.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["servicebus"] will be destroyed
  # (because azurerm_private_dns_zone.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "private_dns_zones" {
      - id                                                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.servicebus.windows.net" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                                                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.servicebus.windows.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["srch"] will be destroyed
  # (because azurerm_private_dns_zone.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "private_dns_zones" {
      - id                                                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.search.windows.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.search.windows.net" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                                                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.search.windows.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["table"] will be destroyed
  # (because azurerm_private_dns_zone.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "private_dns_zones" {
      - id                                                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.table.core.windows.net" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                                                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.table.core.windows.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["vault"] will be destroyed
  # (because azurerm_private_dns_zone.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "private_dns_zones" {
      - id                                                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.vaultcore.azure.net" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                                                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.vaultcore.azure.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["azure_api_net"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.private_dns_links is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      - id                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/azure-api.net/virtualNetworkLinks/io-u-itn-cgn-pe-vnet-01" -> null
      - name                  = "io-u-itn-cgn-pe-vnet-01" -> null
      - private_dns_zone_name = "azure-api.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null
      - virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01" -> null
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["azurewebsites"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.private_dns_links is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      - id                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net/virtualNetworkLinks/io-u-itn-cgn-pe-vnet-01" -> null
      - name                  = "io-u-itn-cgn-pe-vnet-01" -> null
      - private_dns_zone_name = "privatelink.azurewebsites.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null
      - virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01" -> null
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["blob"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.private_dns_links is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      - id                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/io-u-itn-cgn-pe-vnet-01" -> null
      - name                  = "io-u-itn-cgn-pe-vnet-01" -> null
      - private_dns_zone_name = "privatelink.blob.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null
      - virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01" -> null
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["documents"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.private_dns_links is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      - id                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com/virtualNetworkLinks/io-u-itn-cgn-pe-vnet-01" -> null
      - name                  = "io-u-itn-cgn-pe-vnet-01" -> null
      - private_dns_zone_name = "privatelink.documents.azure.com" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null
      - virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01" -> null
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["file"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.private_dns_links is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      - id                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net/virtualNetworkLinks/io-u-itn-cgn-pe-vnet-01" -> null
      - name                  = "io-u-itn-cgn-pe-vnet-01" -> null
      - private_dns_zone_name = "privatelink.file.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null
      - virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01" -> null
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["management_azure_api_net"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.private_dns_links is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      - id                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/management.azure-api.net/virtualNetworkLinks/io-u-itn-cgn-pe-vnet-01" -> null
      - name                  = "io-u-itn-cgn-pe-vnet-01" -> null
      - private_dns_zone_name = "management.azure-api.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null
      - virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01" -> null
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["psql"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.private_dns_links is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      - id                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com/virtualNetworkLinks/io-u-itn-cgn-pe-vnet-01" -> null
      - name                  = "io-u-itn-cgn-pe-vnet-01" -> null
      - private_dns_zone_name = "privatelink.postgres.database.azure.com" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null
      - virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01" -> null
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["queue"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.private_dns_links is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      - id                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net/virtualNetworkLinks/io-u-itn-cgn-pe-vnet-01" -> null
      - name                  = "io-u-itn-cgn-pe-vnet-01" -> null
      - private_dns_zone_name = "privatelink.queue.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null
      - virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01" -> null
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["redis"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.private_dns_links is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      - id                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net/virtualNetworkLinks/io-u-itn-cgn-pe-vnet-01" -> null
      - name                  = "io-u-itn-cgn-pe-vnet-01" -> null
      - private_dns_zone_name = "privatelink.redis.cache.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null
      - virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01" -> null
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["scm_azure_api_net"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.private_dns_links is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      - id                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/scm.azure-api.net/virtualNetworkLinks/io-u-itn-cgn-pe-vnet-01" -> null
      - name                  = "io-u-itn-cgn-pe-vnet-01" -> null
      - private_dns_zone_name = "scm.azure-api.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null
      - virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01" -> null
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["servicebus"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.private_dns_links is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      - id                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net/virtualNetworkLinks/io-u-itn-cgn-pe-vnet-01" -> null
      - name                  = "io-u-itn-cgn-pe-vnet-01" -> null
      - private_dns_zone_name = "privatelink.servicebus.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null
      - virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01" -> null
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["srch"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.private_dns_links is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      - id                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.search.windows.net/virtualNetworkLinks/io-u-itn-cgn-pe-vnet-01" -> null
      - name                  = "io-u-itn-cgn-pe-vnet-01" -> null
      - private_dns_zone_name = "privatelink.search.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null
      - virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01" -> null
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["table"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.private_dns_links is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      - id                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net/virtualNetworkLinks/io-u-itn-cgn-pe-vnet-01" -> null
      - name                  = "io-u-itn-cgn-pe-vnet-01" -> null
      - private_dns_zone_name = "privatelink.table.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null
      - virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01" -> null
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["vault"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.private_dns_links is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      - id                    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/virtualNetworkLinks/io-u-itn-cgn-pe-vnet-01" -> null
      - name                  = "io-u-itn-cgn-pe-vnet-01" -> null
      - private_dns_zone_name = "privatelink.vaultcore.azure.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-u-itn-cgn-pe-rg-01" -> null
      - tags                  = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Uat"
          - "ManagementTeam" = "IO CGN"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        } -> null
      - virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01" -> null
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
        id                                             = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Web/sites/io-u-itn-cgn-attribute-authority-app-01"
        name                                           = "io-u-itn-cgn-attribute-authority-app-01"
      ~ service_plan_id                                = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Web/serverFarms/io-u-itn-cgn-attribute-authority-asp-01" -> (known after apply)
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_linux_web_app_slot.this[0] will be created
  + resource "azurerm_linux_web_app_slot" "this" {
      + app_metadata                                   = (known after apply)
      + app_service_id                                 = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Web/sites/io-u-itn-cgn-attribute-authority-app-01"
      + app_settings                                   = {
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "100"
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"           = (sensitive value)
          + "ATTRIBUTE_AUTHORITY_POSTGRES_DB_SSL_ENABLED"     = "true"
          + "ATTRIBUTE_AUTHORITY_POSTGRES_DB_URI"             = ""
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "128"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "NODE_ENV"                                        = "production"
          + "SERVER_PORT"                                     = "8080"
          + "WEBSITES_ENABLE_APP_SERVICE_STORAGE"             = "false"
          + "WEBSITES_PORT"                                   = "8080"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_NODE_DEFAULT_VERSION"                    = "18.13.0"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      + virtual_network_subnet_id                      = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01/subnets/io-u-itn-cgn-attribute-authority-app-snet-01"
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/ping"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "20-lts"
            }
        }
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_private_endpoint.staging_app_service_sites[0] will be created
  + resource "azurerm_private_endpoint" "staging_app_service_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-u-itn-cgn-attribute-authority-staging-app-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-u-itn-cgn-pe-rg-01"
      + subnet_id                = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01/subnets/io-u-itn-cgn-pe-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-u-itn-cgn-attribute-authority-staging-app-pep-01"
          + private_connection_resource_id = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Web/sites/io-u-itn-cgn-attribute-authority-app-01"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-staging",
            ]
        }
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_service_plan.this[0] must be replaced
-/+ resource "azurerm_service_plan" "this" {
      ~ id                           = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Web/serverFarms/io-u-itn-cgn-attribute-authority-asp-01" -> (known after apply)
      ~ kind                         = "linux" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
        name                         = "io-u-itn-cgn-attribute-authority-asp-01"
      ~ reserved                     = true -> (known after apply)
      ~ sku_name                     = "B1" -> "F1"
        tags                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      ~ worker_count                 = 1 -> (known after apply)
      ~ zone_balancing_enabled       = false -> true # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_subnet.this will be updated in-place
  ~ resource "azurerm_subnet" "this" {
      ~ address_prefixes                               = [
          - "10.25.0.0/26",
          + "10.30.0.0/26",
        ]
        id                                             = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01/subnets/io-u-itn-cgn-attribute-authority-app-snet-01"
        name                                           = "io-u-itn-cgn-attribute-authority-app-snet-01"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 2 to change, 29 to destroy.

Warning: Argument is deprecated

  with module.networking.module.pep_snet.azurerm_subnet.this,
  on .terraform/modules/networking.pep_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
